jQuery(document).on('change', '#field_student_city', function(){
	var val = jQuery(this).val();

	if(val == 'القاهرة'){
		var vals = ["ديوان المديرية","روض الفرج","الساحل","شبرا","الشرابية","المطرية","مدينة السلام","الوايلى","الزيتون","مصر الجديدة","شرق مدينة نصر","وسط القاهرة","عابدين","غرب القاهرة","السيدة زينب","مصر القديمة","المعادى","حلوان","عين شمس","التبين","منشأة ناصر","المرج","حدائق القبة","البساتين و دار السلام","الزاوية","الخليفة","النزهة","باب الشعرية","غرب مدينة نصر","القاهرة الجديدة","المعصرة","المستقبل","الشروق"];
	}else if(val == 'الإسكندرية'){
		var vals = ["ديوان المديرية","شرق الإسكندرية","المنتزه","وسط  الإسكندرية","غرب الإسكندرية","الجمرك","العامرية","برج العرب","العجمى"];
	}else if(val == 'بور سعيد'){
		var vals = ["ديوان المديرية","شمال بور سعيد","جنوب بور سعيد","شرق بور سعيد","بور فؤاد","بحر البقر"];
	}else if(val == 'السويس'){
		var vals = ["ديوان المديرية","شمال السويس","جنوب السويس","الجناين"];
	}else if(val == 'دمياط'){
		var vals = ["ديوان المديرية","دمياط","فارسكور","كفر سعد","الزرقا","عزبة البرج","كفر البطيخ","الروضة","دمياط الجديدة","السرو","ميت أبو غالب"];
	}else if(val == 'الدقهلية'){
		var vals = ["ديوان المديرية","شرق المنصورة","طلخا","ميت غمر","السنبلاوين","بلقاس","شربين","أجا","دكرنس","مدينة النصر","المنزلة","الجمالية","المطرية","غرب المنصورة","نبروة","تمى الأمديد","ميت سلسيل","بنى عبيد"];
	}else if(val == 'الشرقية'){
		var vals = ["ديوان المديرية","غرب الزقازيق","ِشرق الزقازيق","فاقوس","منيا القمح","بلبيس","ابو كبير","ابو حماد","الحسنية","ديرب نجم","ههيا","كفر صقر","أولاد صقر","مشتول السوق","الابراهيمية","القرين","العاشر من رمضان","القنايات","الصالحية الجديدة","صان الحجر","منشأة ابو عمر"];
	}else if(val == 'القليوبية'){
		var vals = ["ديوان المديرية","بنها","غرب شبرا الخيمة","طوخ","شبين القناطر","الخانكة","قليوب","القناطر الخيرية","شرق شبرا الخيمة","كفر شكر","العبور ","الخصوص","قها"];
	}else if(val == 'كفر الشيخ'){
		var vals = ["ديوان المديرية","دسوق","بيلا","سيدى سالم","بلطيم","فوة","قلين","مطوبس","الحامول ","الرياض","شرق كفر الشيخ","غرب كفر الشيخ","برج البرلس","سيدى غازى"];
	}else if(val == 'الغربية'){
		var vals = ["ديوان المديرية","شرق طنطا","شرق المحلة","زفتا","السنطة","بسيون","سمنود","قطور","كفر الزيات","غرب طنطا","غرب المحلة"];
	}else if(val == 'المنوفية'){
		var vals = ["ديوان المديرية","شبين الكوم","اشمون","منوف","تلا","قويسنا","الباجور","الشهداء","بركة السبع","سرس الليان","السادات"];
	}else if(val == 'البحيرة'){
		var vals = ["ديوان المديرية","بندر دمنهور","بندر كفر الدوار","كوم حمادة","الدلنجات","ابوحمص","ايتاى البارود","ابو المطامير","رشيد","المحمودية","شبرا خيت","حوش عيسى","وادى النطرون","الرحمانية","ادكو","مركز دمنهور","التحرير","مركز كفر الدوار","النوبارية"];
	}else if(val == 'الإسماعيلية'){
		var vals = ["ديوان المديرية","فايد ","التل الكبير","القنطرة غرب","القنطرة شرق","ابو صوير ","القصاصين","شمال الإسماعيلية ","جنوب الاسماعيلية"];
	}else if(val == 'الجيزة'){
		var vals = ["ديوان المديرية","شمال الجيزة","بولاق الدكرور","جنوب الجيزة","العجوزة","اوسيم","الهرم","البدرشين","العياط","ابو النمرس","الحواميدية","الصف","اطفيح","الواحات البحرية","الدقى","العمرانية","منشأة القناطر","الوراق","اكتوبر","كرداسة","الشيخ زايد"];
	}else if(val == 'بنى سويف'){
		var vals = ["ديوان المديرية","بنى سويف","ببا","الواسطى","ناصر","اهناسيا","الفشن","سمسطا"];
	}else if(val == 'الفيوم'){
		var vals = ["ديوان المديرية","شرف الفيوم","ابشواى","سنورس","اطسا","طامية","يوسف الصديق","غرب الفيوم"];
	}else if(val == 'المنيا'){
		var vals = ["ديوان المديرية","المنيا","ملوى","سمالوط","بنى مزار","ابو قرقاص","مغاغة","دير مواس","مطاى","العدوة"];
	}else if(val == 'أسيوط'){
		var vals = ["ديوان المديرية","اسيوط","ديروط","منفلوط","ابوتيج","القوصية","ابنوب","البدارى","صدفا","الغنايم","ساحل سليم","الفتح"];
	}else if(val == 'سوهاج'){
		var vals = ["ديوان المديرية","سوهاج","جرجا","طهطا","طما","البلينا","المنشأة","أخميم","المراغة","ساقلتا","دار السلام","جهينة"];
	}else if(val == 'قنا'){
		var vals = ["ديوان المديرية","قنا","قوص","دشنا","نجع حمادى","ابو تشت","نقادة","فرشوط","قفط","الوقف"];
	}else if(val == 'أسوان'){
		var vals = ["ديوان المديرية","ادفو","اسوان","كوم امبو","نصر","دراو"];
	}else if(val == 'البحر الأحمر'){
		var vals = ["ديوان المديرية","الغردقة","القصير ","رأس غارب","سفاجا","مرسى علم","شلاتين","حلايب"];
	}else if(val == 'الوادى الجديد'){
		var vals = ["ديوان المديرية","الخارجة","الداخلة","الفرافرة","باريس ","بلاط"];
	}else if(val == 'مطروح'){
		var vals = ["ديوان المديرية","مطروح","الضبعة","الحمام","السلوم","سيوة","النجيلة","برانى ","العلمين"];
	}else if(val == 'شمال سيناء'){
		var vals = ["ديوان المديرية","العريش","الشيخ زويد","بئر العبد","رفح","الحسنة","نخل"];
	}else if(val == 'جنوب سيناء'){
		var vals = ["ديوان المديرية","رأس سدر","سانت كاترين","الطور","ابورديس","دهب ","ابو زنيمة","شرم الشيخ","نويبع"];
	}else if(val == 'الأقصر'){
		var vals = ["اسنا","ارمنت","ديوان المديرية","مدينة الأقصر","البياضية","القرنة","الزينية","الطور"];
	}else{
		var vals = [];
	}
	

	jQuery('#field_edu_admin').find('option').remove();
	jQuery.each(vals, function(x, v){
		jQuery('#field_edu_admin').append('<option value="'+v+'">'+v+'</option>');
	});
});